# PyCity School Analysis

Write analysis here....

In [1]:
import pandas as pd 
from pathlib import Path

In [2]:
school_path = Path("Resources/schools_complete.csv")
student_path = Path("Resources/students_complete.csv")

In [3]:
school_data_df = pd.read_csv(school_path)
student_data_df = pd.read_csv(student_path)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [4]:
all_school_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
all_school_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [5]:
all_school_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

# District Summary

In [6]:
#school count
school_count = len(all_school_df["school_name"].unique())
print(school_count)

15

In [7]:
#total students
student_count = len(all_school_df["Student ID"].unique())
print(student_count)

39170

In [8]:
#budget total
budget_total = school_data_df["budget"].sum()
budget_total

24649428

In [9]:
#average math score
math_average = all_school_df["math_score"].mean()
math_average

78.98537145774827

In [10]:
#average reading score 
reading_average = all_school_df ["reading_score"].mean()
reading_average

81.87784018381414

In [11]:
#percent of students who passed math
math_pass_total = all_school_df[(all_school_df["math_score"] >= 70)].count()["student_name"]
math_pass_percent = math_pass_total / float(student_count) * 100
math_pass_percent

74.9808526933878

In [12]:
#percent of students who passed reading
reading_pass_total = all_school_df[(all_school_df["reading_score"] >= 70)].count()["student_name"]
reading_pass_percent = reading_pass_total / float(student_count) * 100
reading_pass_percent

85.80546336482001

In [13]:
#percent of students that passed math AND reading
math_reading_pass_total = all_school_df[
    (all_school_df["math_score"] >= 70) & (all_school_df["reading_score"] >= 70)].count()["student_name"]
overall_pass_rate = math_reading_pass_total / float(student_count) * 100
overall_pass_rate

65.17232575950983

In [14]:
#put the district summary into a DataFrame: "Total Schools", "Total Students",
#"Total Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading",
#"% Overall Passing"

district_summary = pd.DataFrame({"Total Schools": [school_count],
                                "Total Students": [student_count],
                                "Total Budget": [budget_total],
                                "Average Math Score": [math_average], 
                                "Average Reading Score": [reading_average],
                                "% Passing Math": [math_pass_percent],
                                "% Passing Reading": [reading_pass_percent],
                                "% Overall Passing": overall_pass_rate})

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [15]:
# Formatting
district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

# School Summary

In [23]:
all_school_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [25]:
#trying another way to sort
school_id_df = all_school_df.sort_values("School ID", ascending=True)
school_id_df = all_school_df.reset_index(drop=True)
school_id_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [26]:
#need to sort by 'School ID'
#school_ID_sort_df = all_school_df.sort_values("School ID")
#school_ID_sort_df

In [27]:
#new_index_school_id = school_ID_sort_df.reset_index(drop=True)
#new_index_school_id

In [56]:
#school name
school_name = (all_school_df["school_name"].unique())
school_name

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [81]:
#school name by group
school_name2 = all_school_df.groupby(["school_name"])
school_name_all = school_name2 ["school_name"].count()
school_name_all

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: school_name, dtype: int64

In [57]:
#school ID
#school_id = (all_school_df["School ID"].unique())
#school_id

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14],
      dtype=int64)

In [58]:
#school type  - district, charter - column 'type'
school_type = (all_school_df["type"].unique())
school_type

array(['District', 'Charter'], dtype=object)

In [31]:
#students per school using group
#grouped_students = all_school_df.groupby(["school_name"])
#grouped_students.count()
#student_size = grouped_students[["size"]].count()
#student_size

In [59]:
#total students per school ###old code but may need again ##this needs to be a groupby
school_size = (all_school_df["size"].unique())
school_size

array([2917, 2949, 1761, 4635, 1468, 2283, 1858, 4976,  427,  962, 1800,
       3999, 4761, 2739, 1635], dtype=int64)

In [33]:
#grouped_school_size = all_school_df.groupby(["school_name"])
#grouped_school_size.count()
#school_size_total = (grouped_school_size[["size"]].count())
#school_size_total

In [34]:
#school_size2 = all_school_df[(all_school_df["size"])]
#school_size_group = school_size2.groupby(["school_name"]).count()

#school_size_group

#use iloc?

In [35]:
#school_size3 = school_data_df.loc[:, ["School ID", "size"]]
#school_size3

In [60]:
#budget per school
budget_per_school = (all_school_df["budget"].unique())
budget_per_school

array([1910635, 1884411, 1056600, 3022020,  917500, 1319574, 1081356,
       3124928,  248087,  585858, 1049400, 2547363, 3094650, 1763916,
       1043130], dtype=int64)

In [61]:
all_school_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [62]:
#calculate size
#school_size = (all_school_df["size"].unique())
#school_size

In [63]:
#budget per capita
budget_per_capita = budget_per_school / school_size
budget_per_capita

array([655., 639., 600., 652., 625., 578., 582., 628., 581., 609., 583.,
       637., 650., 644., 638.])

In [64]:
grouped_school_name = all_school_df.groupby(["School ID"])
grouped_school_name.count()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,type,size,budget
School ID,,,,,,,,,,
0,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917
1,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
2,1761,1761,1761,1761,1761,1761,1761,1761,1761,1761
3,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635
4,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468
5,2283,2283,2283,2283,2283,2283,2283,2283,2283,2283
6,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
7,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
8,427,427,427,427,427,427,427,427,427,427
9,962,962,962,962,962,962,962,962,962,962
10,1800,1800,1800,1800,1800,1800,1800,1800,1800,1800
11,3999,3999,3999,3999,3999,3999,3999,3999,3999,3999
12,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761
13,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
14,1635,1635,1635,1635,1635,1635,1635,1635,1635,1635

In [41]:
grouped_school_name[["math_score"]].sum()

           math_score
School ID
0              223528
1              226223
2              146796
3              358238
4              122360
5              190115
6              154329
7              383393
8               35784
9               80654
10             150628
11             307294
12             366942
13             211184
14             136389

In [42]:
#average test score per school for MATH
#first find the total math score per school

math_average_school = grouped_school_name["math_score"].mean()
math_average_school

School ID
0     76.629414
1     76.711767
2     83.359455
3     77.289752
4     83.351499
5     83.274201
6     83.061895
7     77.048432
8     83.803279
9     83.839917
10    83.682222
11    76.842711
12    77.072464
13    77.102592
14    83.418349
Name: math_score, dtype: float64

In [43]:
#average test score per school for READING
grouped_school_name[["reading_score"]].sum()

           reading_score
School ID
0                 236810
1                 239335
2                 147441
3                 375131
4                 123043
5                 191748
6                 156027
7                 403225
8                  35789
9                  80851
10                151119
11                322898
12                385481
13                221164
14                137093

In [44]:
reading_average_school = grouped_school_name["reading_score"].mean()
reading_average_school

School ID
0     81.182722
1     81.158020
2     83.725724
3     80.934412
4     83.816757
5     83.989488
6     83.975780
7     81.033963
8     83.814988
9     84.044699
10    83.955000
11    80.744686
12    80.966394
13    80.746258
14    83.848930
Name: reading_score, dtype: float64

In [65]:
#students passing math by school
students_passing_math = all_school_df[(all_school_df["math_score"] >= 70)]
students_passing_math_school = students_passing_math.groupby(["School ID"]).size()

students_passing_math_school

School ID
0     1916
1     1946
2     1653
3     3094
4     1371
5     2143
6     1749
7     3318
8      395
9      910
10    1680
11    2654
12    3145
13    1871
14    1525
dtype: int64

In [66]:
per_school_passing_math = students_passing_math_school / school_size * 100
per_school_passing_math

School ID
0     65.683922
1     65.988471
2     93.867121
3     66.752967
4     93.392371
5     93.867718
6     94.133477
7     66.680064
8     92.505855
9     94.594595
10    93.333333
11    66.366592
12    66.057551
13    68.309602
14    93.272171
dtype: float64

In [67]:
#students passing reading by school
students_passing_reading = all_school_df[(all_school_df["reading_score"] >= 70)]
students_passing_reading_school = students_passing_reading.groupby(["School ID"]).size()

students_passing_reading_school

School ID
0     2372
1     2381
2     1688
3     3748
4     1426
5     2204
6     1803
7     4077
8      411
9      923
10    1739
11    3208
12    3867
13    2172
14    1591
dtype: int64

In [68]:
per_school_passing_reading = students_passing_reading_school / school_size * 100
per_school_passing_reading

School ID
0     81.316421
1     80.739234
2     95.854628
3     80.862999
4     97.138965
5     96.539641
6     97.039828
7     81.933280
8     96.252927
9     95.945946
10    96.611111
11    80.220055
12    81.222432
13    79.299014
14    97.308869
dtype: float64

In [69]:
#students that passed math and reading
students_passing_math_and_reading = all_school_df[
    (all_school_df["reading_score"] >= 70) & (all_school_df["math_score"] >= 70)
]

school_students_passing_math_and_reading = students_passing_math_and_reading.groupby(["School ID"]).size()
school_students_passing_math_and_reading

School ID
0     1561
1     1569
2     1583
3     2481
4     1330
5     2068
6     1697
7     2719
8      381
9      871
10    1626
11    2119
12    2549
13    1487
14    1487
dtype: int64

In [70]:
#overall passing
overall_passing_rate = school_students_passing_math_and_reading / school_size * 100
overall_passing_rate

School ID
0     53.513884
1     53.204476
2     89.892107
3     53.527508
4     90.599455
5     90.582567
6     91.334769
7     54.642283
8     89.227166
9     90.540541
10    90.333333
11    52.988247
12    53.539172
13    54.289887
14    90.948012
dtype: float64

In [72]:
per_school_summary = pd.DataFrame({"School Name": [school_name],
                                  "School Type": [school_type],
                                  "Total Students": [school_size],
                                  "Total School Budget": [budget_per_school],
                                  "Per Student Budget": [budget_per_capita],
                                  "Average Math Score": [math_average_school],
                                  "Average Reading Score": [reading_average_school],
                                  "% Passing Math": [per_school_passing_math],
                                  "% Passing Reading": [per_school_passing_reading],
                                  "% Overall Passing": [overall_passing_rate]})

per_school_summary

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,"[Huang High School, Figueroa High School, Shel...","[District, Charter]","[2917, 2949, 1761, 4635, 1468, 2283, 1858, 497...","[1910635, 1884411, 1056600, 3022020, 917500, 1...","[655.0, 639.0, 600.0, 652.0, 625.0, 578.0, 582...",School ID 0 76.629414 1 76.711767 2 ...,School ID 0 81.182722 1 81.158020 2 ...,School ID 0 65.683922 1 65.988471 2 ...,School ID 0 81.316421 1 80.739234 2 ...,School ID 0 53.513884 1 53.204476 2 ...